data_generation/simulation_results/of/case_33/constant/simParams
nIter 2000;
hComponent0 1460.756254547353;
hComponent1 777.5146218432303;
hComponent2 656.689884569527;
hComponent3 1497.4520290693204;
hComponent4 854.8300252993822;kComponent0 49.84282229072849;
kComponent1 59.4128167047705;
kComponent2 85.76985934837016;
kComponent3 26.381322442967768;
kComponent4 80.2115213232842;
tAmbient 300;
Ux 2.0443258097994113;
kPCB 0.26652347218373995;