data_generation/simulation_results/of/case_33/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          probesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

_volFieldValue
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    enabled         true;
    writeControl    timeStep;
    writeInterval   1;
    log             true;
    valueOutput     false;
    writeFields     false;
}

fluid
{
    ${_volFieldValue}

    regionType      cellZone;
    name            fluid;
    region          fluid;
    operation       volAverage;
    fields          ( T );
}

pcb
{
    ${_volFieldValue}

    regionType      cellZone;
    name            pcb;
    region          pcb;
    operation       volAverage;
    fields          ( T );
}

component_0
{
    ${_volFieldValue}

    regionType      cellZone;
    name            component_0;
    region          component_0;
    operation       volAverage;
    fields          ( T );
}

component_1
{
    ${_volFieldValue}

    regionType      cellZone;
    name            component_1;
    region          component_1;
    operation       volAverage;
    fields          ( T );
}

component_2
{
    ${_volFieldValue}

    regionType      cellZone;
    name            component_2;
    region          component_2;
    operation       volAverage;
    fields          ( T );
}

component_3
{
    ${_volFieldValue}

    regionType      cellZone;
    name            component_3;
    region          component_3;
    operation       volAverage;
    fields          ( T );
}

component_4
{
    ${_volFieldValue}

    regionType      cellZone;
    name            component_4;
    region          component_4;
    operation       volAverage;
    fields          ( T );
}

#remove (_volFieldValue)

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //